In [1]:
import numpy as np
import pandas as pd
import sklearn

In [2]:
takamatu = pd.read_csv("keiba_takamatu.csv")

In [3]:
takamatu.head()

,race_id,rank,rane_number,just_number,sex,age,mascle,popular,weight,horse_id,jocky_id
0,2.020000e+11,1,7,13,1,7,58,12,518,20160509,20000622
1,2.020000e+11,2,7,15,0,4,56,2,466,20190330,19881225
2,2.020000e+11,3,1,1,1,8,58,13,484,20150404,19851105
3,2.020000e+11,4,3,6,1,7,58,9,492,20160405,19860520
4,2.020000e+11,5,8,16,1,5,58,10,468,20180204,20000531

In [4]:
y = takamatu["rank"]
x = np.array(takamatu.drop(["rank", "horse_id"], axis=1))

In [5]:
y_array = np.array(y)
x_array = np.array(x)

In [6]:
print("y_array: ", y_array.shape)
print("x_array: ", x_array.shape)

y_array:  (54,)
x_array:  (54, 9)

In [7]:
from sklearn.model_selection import train_test_split

In [8]:
x_train, x_test, y_train, y_test = train_test_split(x_array, y_array, test_size=0.2, random_state=0)

In [9]:
print("x_train: ", x_train.shape)
print("y_train: ", y_train.shape)
print("x_test: ", x_test.shape)
print("y_test: ", y_test.shape)

x_train:  (43, 9)
y_train:  (43,)
x_test:  (11, 9)
y_test:  (11,)

In [10]:
from sklearn.ensemble import RandomForestClassifier

In [11]:
rfc = RandomForestClassifier(random_state=0)

In [12]:
rfc.fit(x_train, y_train)

RandomForestClassifier(random_state=0)

In [13]:
y_pred = rfc.predict(x_test)

In [14]:
print(y_pred)

[ 1 15  4 17  6  9  1  8 10 11 10]

In [16]:
takamatu2 = pd.read_csv("keiba_takamatu_text.csv")

In [18]:
takamatu2.head()

,race_id,rank,rane_number,just_number,sex,age,mascle,popular,weight,horse_id,jocky_id
0,2.020000e+11,1,8,16,0,5,55,9,494,20150401,19950904
1,2.020000e+11,2,4,8,0,4,55,2,486,20160124,19790723
2,2.020000e+11,3,2,3,1,5,57,4,472,20150512,19861003
3,2.020000e+11,4,6,11,1,4,57,15,494,20160317,19770623
4,2.020000e+11,5,8,17,1,5,57,12,500,20150327,19860317

In [20]:
x2 = np.array(takamatu2.drop(["rank","horse_id"], axis=1))

In [21]:
x2_array = np.array(x2)

In [22]:
y2_pred = rfc.predict(x2_array)

In [23]:
print(y2_pred)

[ 2  2  1 14 10 14 14  9  1  3 16  3 14  8 12 17  8  8]

In [25]:
takamatu3 = takamatu2.drop(["race_id","rane_number","just_number","sex","age","mascle","popular","weight","jocky_id"], axis=1)

In [27]:
print(takamatu3)

    rank  horse_id
0      1  20150401
1      2  20160124
2      3  20150512
3      4  20160317
4      5  20150327
5      6  20160405
6      7  20130308
7      8  20100418
8      9  20150115
9     10  20150306
10    11  20160204
11    12  20150209
12    13  20140331
13    14  20130311
14    15  20150225
15    16  20150411
16    17  20130409
17    18  20160520

In [28]:
takamatu3["rank"] = y2_pred

In [29]:
print(takamatu3)

    rank  horse_id
0      2  20150401
1      2  20160124
2      1  20150512
3     14  20160317
4     10  20150327
5     14  20160405
6     14  20130308
7      9  20100418
8      1  20150115
9      3  20150306
10    16  20160204
11     3  20150209
12    14  20140331
13     8  20130311
14    12  20150225
15    17  20150411
16     8  20130409
17     8  20160520

In [31]:
takamatu3.to_csv("takamatu_pred.csv", index=False)